Revit 2026 API

# WallSide Enumeration

---

Represents the possible sides of a wall where a sweep or reveal may be attached.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WallSide
```
```vb
Public Enumeration WallSide
```
```cpp
public enum class WallSide
```
```fsharp
type WallSide
```

| Member name | Value | Description |
| --- | --- | --- |
| Exterior | 0 | The exterior of the wall. |
| Interior | 1 | The interior of the wall. |

#### Reference

Autodesk.Revit.DB Namespace